In [10]:
import pandas as pd

In [11]:
person_data = {
    "personId": [1, 2],
    "lastName": ["Wang", "Alice"],
    "firstName": ["Allen", "Bob"]
}

In [12]:
address_data = {
    "addressId": [1, 2],
    "personId": [2, 3],
    "city": ["New York City", "LeetCode"],
    "state": ["New York", "California"]
}

In [13]:
# create dataframe
person = pd.DataFrame(person_data)
address = pd.DataFrame(address_data)

In [14]:
person

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [15]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       LeetCode  California

In [17]:
# Perform left join
result_df = pd.merge(person, address, on='personId', how='left')
result_df

   personId lastName firstName  addressId           city     state
0         1     Wang     Allen        NaN            NaN       NaN
1         2    Alice       Bob        1.0  New York City  New York

In [18]:
# Reordering
result_df = result_df[['firstName', 'lastName', 'city', 'state']]
result_df

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York